# BuiltInFailures.IlluminationFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..IlluminationFailures Class
BuiltInFailures Class Members See Also
---
Failures about Illumination.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class IlluminationFailures
```

Visual Basic
---
```text
Public NotInheritable Class IlluminationFailures
```

Visual C++
---
```text
public ref class IlluminationFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..IlluminationFailures
# See Also
BuiltInFailures..::..IlluminationFailures Members
Autodesk.Revit.DB Namespace